### Import Dependencies

In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from config import conn_string

**get all files for loading**

In [2]:
# path
station_path = os.path.join('.', "station_info.csv")
weather_path = os.path.join('.', "historical_weather.csv")

#bikes
toronto_bikes = os.path.join("Resources/1_toronto_canada", "toronto_bikes.csv")
vancouver_bikes = os.path.join("Resources/2_vancouver_canada", "vancouver_bikes.csv")
boston_bikes = os.path.join("Resources/3_boston_us", "boston_bikes.csv")
nyc_bikes = os.path.join("Resources/4_NewYork_US", "nyc_bikes.csv")

# membertypes
toronto_users = os.path.join("Resources/1_toronto_canada", "toronto_membertypes.csv")
vancouver_users = os.path.join("Resources/2_vancouver_canada", "vancouver_membertypes.csv")
boston_users = os.path.join("Resources/3_boston_us", "boston_membertypes.csv")
nyc_users = os.path.join("Resources/4_NewYork_US", "nyc_membertypes.csv")

# ridership
toronto_ = os.path.join("Resources/1_toronto_canada", "toronto_bikeshare.csv")
vancouver_ = os.path.join("Resources/2_vancouver_canada", "vancouver_bikeshare.csv")
boston_ = os.path.join("Resources/3_boston_us", "boston_bikeshare.csv")
nyc_ = os.path.join("Resources/4_NewYork_US", "nyc_bikeshare.csv")

In [3]:
# read files
stns = pd.read_csv(station_path, encoding="utf-8")
weather = pd.read_csv(weather_path, encoding="utf-8")

# bikes
tor_bikes = pd.read_csv(toronto_bikes, encoding="utf-8")
van_bikes = pd.read_csv(vancouver_bikes, encoding="utf-8")
bos_bikes = pd.read_csv(boston_bikes, encoding="utf-8")
nyc_bikes = pd.read_csv(nyc_bikes, encoding="utf-8")

# member_types
tor_users = pd.read_csv(toronto_users, encoding="utf-8")
van_users = pd.read_csv(vancouver_users, encoding="utf-8")
bos_users = pd.read_csv(boston_users, encoding="utf-8")
nyc_users = pd.read_csv(nyc_users, encoding="utf-8")

# pricing index


# ridership
toronto = pd.read_csv(toronto_, encoding="utf-8")
vancouver = pd.read_csv(vancouver_, encoding="utf-8")
boston = pd.read_csv(boston_, encoding="utf-8")
newyork = pd.read_csv(nyc_, encoding="utf-8")

In [ ]:
boston = pd.read_csv(boston_, encoding="utf-8")

In [ ]:
boston.count()

**Locations**

In [5]:
# create locations table
locations = [{"location_id": 1,"city":"Toronto", "country":"Canada" }, 
             {"location_id": 2,"city":"Vancouver", "country":"Canada"},
             {"location_id": 3,"city":"Boston", "country":"USA"},
             {"location_id": 4,"city":"New York", "country":"USA"}
            ]

df = pd.DataFrame(locations)
df.set_index("location_id", inplace=True)
df

                  city country
location_id
1              Toronto  Canada
2            Vancouver  Canada
3               Boston     USA
4             New York     USA

**Stations**

In [6]:
stns.head()

,station_id,station_name,latitude,longitude,location_id
0,7000,Fort York Blvd / Capreol Ct,43.639832,-79.395954,1
1,7001,Lower Jarvis St / The Esplanade,43.647830,-79.370698,1
2,7002,St. George St / Bloor St W,43.667333,-79.399429,1
3,7003,Madison Ave / Bloor St W,43.667158,-79.402761,1
4,7004,University Ave / Elm St,43.656518,-79.389099,1

**Historical Weather**

In [7]:
weather.head()

,location_id,forecast_date,maxtempc,humidity,total_precip,avg_cloudcover,avg_windspeed
0,1,2019-01-01,1,77.250,3.6,50.625,16.875
1,1,2019-01-02,-5,69.000,0.2,41.750,8.625
2,1,2019-01-03,-1,68.500,1.3,68.250,17.750
3,1,2019-01-04,2,77.250,0.0,7.625,18.125
4,1,2019-01-05,3,81.125,0.0,23.750,11.250

**Bikes**

In [8]:
tor_bikes.head()

   bike_id  location_id
0     1296            1
1     2947            1
2     2293            1
3      283            1
4     1799            1

In [9]:
van_bikes.head()

   bike_id  location_id
0    388.0            2
1   1880.0            2
2    779.0            2
3   2123.0            2
4    444.0            2

In [10]:
bos_bikes.head()

   bike_id  location_id
0     3689            3
1     4142            3
2     1628            3
3     2969            3
4     3469            3

In [11]:
nyc_bikes.head()

   bike_id  location_id
0    15839            4
1    32723            4
2    27451            4
3    21579            4
4    35379            4

**Member Types**

In [12]:
tor_users.head()

     member_type  location_id
0  Annual Member            1
1  Casual Member            1

In [13]:
van_users.head()

                 member_type  location_id
0               365 Standard            2
1                   365 Plus            2
2     Vancity Community Pass            2
3     365 Day Pass Plus SALE            2
4  365 Day Founding Standard            2

In [14]:
bos_users.head()

  member_type  location_id
0  Subscriber            3
1    Customer            3

In [15]:
nyc_users.head()

  member_type  location_id
0  Subscriber            4
1    Customer            4

**Pricing Index**

**Ridership**

In [16]:
# Toronto
toronto.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257,1799,Annual Member,1

In [17]:
# Vancouver
vancouver.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,177,2/1/2019 0:00,2/1/2019 0:00,198,298,388.0,365 Standard,2
1,221,2/1/2019 0:00,2/1/2019 0:00,193,173,1880.0,365 Plus,2
2,3272,2/1/2019 0:00,2/1/2019 0:00,63,143,779.0,Vancity Community Pass,2
3,157,2/1/2019 0:00,2/1/2019 0:00,64,78,2123.0,365 Day Pass Plus SALE,2
4,516,1/31/2019 23:00,2/1/2019 0:00,60,196,444.0,365 Day Pass Plus SALE,2

In [18]:
# Boston
boston.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,371,2019-01-01 00:09:13.7980,2019-01-01 00:15:25.3360,80,179,3689,Subscriber,3
1,264,2019-01-01 00:33:56.1820,2019-01-01 00:38:20.8800,117,189,4142,Subscriber,3
2,458,2019-01-01 00:41:54.6000,2019-01-01 00:49:33.2730,68,96,1628,Subscriber,3
3,364,2019-01-01 00:43:32.5710,2019-01-01 00:49:37.4260,89,334,2969,Subscriber,3
4,681,2019-01-01 00:49:56.4640,2019-01-01 01:01:17.7010,73,367,3469,Subscriber,3

In [19]:
# New York
newyork.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,320,2019-01-01 00:01:47.4010,2019-01-01 00:07:07.5810,3160.0,3283.0,15839,Subscriber,4
1,316,2019-01-01 00:04:43.7360,2019-01-01 00:10:00.6080,519.0,518.0,32723,Subscriber,4
2,591,2019-01-01 00:06:03.9970,2019-01-01 00:15:55.4380,3171.0,3154.0,27451,Subscriber,4
3,2719,2019-01-01 00:07:03.5450,2019-01-01 00:52:22.6500,504.0,3709.0,21579,Subscriber,4
4,303,2019-01-01 00:07:35.9450,2019-01-01 00:12:39.5020,229.0,503.0,35379,Subscriber,4

#### Load data

In [20]:
# connect to database
cnx = f'postgresql://{conn_string}'
engine = create_engine(cnx)

In [21]:
# confirm tables
engine.table_names()

['locations',
 'membertypes',
 'stations',
 'bikes',
 'ridership',
 'pricing',
 'historicalweather']

In [ ]:
# load locations into database
df.to_sql(name='locations', con=engine, if_exists='append', index=True)

In [ ]:
# load stations into database
stns.to_sql(name='stations', con=engine, if_exists='append', index=False)

In [ ]:
# load historical weather into database
weather.to_sql(name='historicalweather', con=engine, if_exists='append', index=False)

In [ ]:
# load toronto bikes into database
tor_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load vancouver bikes into database
van_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load boston bikes into database
bos_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load new york bikes into database
nyc_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [ ]:
# load toronto member types
tor_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load vancouver member types
van_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load boston member types
bos_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [ ]:
# load new york member types
nyc_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

**Load Ridership**

In [24]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session

# check reference to stations table
# create session
session = Session(bind=engine)
# declare a base using automap_base
Base = automap_base()
# use the Base class to reflect the database tables
Base.prepare(engine, reflect=True)
Base.classes.keys()
Stations = Base.classes.stations

***Verify that all station_ids used in bikeshare exists in Stations table***

In [25]:
all_stations = session.query(Stations.station_id).all()
all_stns_df = pd.DataFrame(all_stations)
all_stns_df

      station_id
0           7000
1           7001
2           7002
3           7003
4           7004
...          ...
2396        4248
2397        4249
2398        4250
2399        4252
2400        4253

[2401 rows x 1 columns]

***Toronto***

In [ ]:
missing_start = toronto[-toronto["start_station_id"].isin(all_stns_df["station_id"])]
missing_start = missing_start.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_start

In [ ]:
missing_end = toronto[-toronto["end_station_id"].isin(all_stns_df["station_id"])]
missing_end = missing_end.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_end

*Load rows with station_id existing in stations table*

In [ ]:
toronto = toronto[toronto["start_station_id"].isin(all_stns_df["station_id"])]
toronto = toronto[toronto["end_station_id"].isin(all_stns_df["station_id"])]

In [ ]:
toronto

In [ ]:
toronto.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

***Vancouver***

In [ ]:
missing_start = vancouver[-vancouver["start_station_id"].isin(all_stns_df["station_id"])]
missing_start = missing_start.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_start

In [ ]:
missing_end = vancouver[-vancouver["end_station_id"].isin(all_stns_df["station_id"])]
missing_end = missing_end.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_end

*Load rows with station_id existing in stations table*

In [ ]:
vancouver = vancouver[vancouver["start_station_id"].isin(all_stns_df["station_id"])]
vancouver = vancouver[vancouver["end_station_id"].isin(all_stns_df["station_id"])]

In [ ]:
vancouver

In [ ]:
vancouver.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

***Boston***

In [ ]:
missing_start = boston[-boston["start_station_id"].isin(all_stns_df["station_id"])]
missing_start

In [ ]:
boston.loc[boston['start_station_id']==88]

In [ ]:
missing_end = boston[-boston["end_station_id"].isin(all_stns_df["station_id"])]
missing_end

In [ ]:
boston = boston[boston["start_station_id"].isin(all_stns_df["station_id"])]
boston = boston[boston["end_station_id"].isin(all_stns_df["station_id"])]
boston

In [ ]:
# intersection_df = pd.merge(d1, d2, how ='inner', on =['start_station_id', 'station_id'])

In [ ]:
print(2522771-(14129+15948))

In [ ]:
boston.count()

In [ ]:
stns_boston = session.query(Stations.station_id).filter(Stations.location_id==3).all()
stns_boston = pd.DataFrame(stns_boston)
stns_boston = stns_boston.rename(columns={"station_id": "start_station_id"})
stns_boston

In [ ]:
df = pd.merge(boston, stns_boston, how='inner', on='start_station_id')

In [ ]:
stns_boston = stns_boston.rename(columns={"start_station_id": "end_station_id"})
stns_boston

In [ ]:
boston_df = pd.merge(df, stns_boston, how='inner', on='end_station_id')

In [ ]:
boston_df

In [ ]:
boston_df.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

***New York***

In [26]:
missing_start = newyork[-newyork["start_station_id"].isin(all_stns_df["station_id"])]
missing_start

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
6,280,2019-01-01 00:09:21.0060,2019-01-01 00:14:01.1510,3675.0,3288.0,35391,Subscriber,4
72,740,2019-01-01 00:42:16.3560,2019-01-01 00:54:36.8120,524.0,526.0,34089,Subscriber,4
97,967,2019-01-01 00:50:10.0810,2019-01-01 01:06:17.7230,524.0,236.0,35052,Subscriber,4
138,207,2019-01-01 01:00:48.7520,2019-01-01 01:04:15.8860,3360.0,3434.0,25854,Subscriber,4
143,642,2019-01-01 01:01:34.8600,2019-01-01 01:12:17.7070,3341.0,3529.0,28933,Subscriber,4
...,...,...,...,...,...,...,...,...
99956,467,2019-01-03 21:40:06.5770,2019-01-03 21:47:54.1780,3631.0,436.0,29558,Subscriber,4
99965,139,2019-01-03 21:40:54.0590,2019-01-03 21:43:13.1320,382.0,3463.0,35075,Subscriber,4
99971,125,2019-01-03 21:41:20.4860,2019-01-03 21:43:26.2770,243.0,298.0,35636,Subscriber,4
99992,610,2019-01-03 21:42:59.7330,2019-01-03 21:53:10.0820,3660.0,3255.0,33448,Customer,4
99999,470,2019-01-03 21:43:29.4870,2019-01-03 21:51:20.3550,3474.0,312.0,28394,Subscriber,4

In [27]:
missing_end = newyork[-newyork["end_station_id"].isin(all_stns_df["station_id"])]
missing_end

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
1,316,2019-01-01 00:04:43.7360,2019-01-01 00:10:00.6080,519.0,518.0,32723,Subscriber,4
18,829,2019-01-01 00:19:08.1030,2019-01-01 00:32:57.3880,3165.0,3295.0,32106,Subscriber,4
20,736,2019-01-01 00:21:02.9570,2019-01-01 00:33:19.4110,3165.0,3295.0,16761,Customer,4
28,1068,2019-01-01 00:25:13.8750,2019-01-01 00:43:01.9350,394.0,3431.0,32042,Subscriber,4
58,187,2019-01-01 00:35:03.5980,2019-01-01 00:38:10.6250,484.0,524.0,34089,Subscriber,4
...,...,...,...,...,...,...,...,...
99903,509,2019-01-03 21:37:30.1870,2019-01-03 21:46:00.1730,340.0,3701.0,35319,Subscriber,4
99904,333,2019-01-03 21:37:26.4860,2019-01-03 21:42:59.9570,174.0,3431.0,32840,Subscriber,4
99909,388,2019-01-03 21:37:41.5310,2019-01-03 21:44:09.7860,3284.0,3168.0,28117,Subscriber,4
99914,307,2019-01-03 21:38:13.3420,2019-01-03 21:43:20.4560,3435.0,3474.0,27723,Subscriber,4
99963,2073,2019-01-03 21:40:34.8330,2019-01-03 22:15:08.6960,369.0,3660.0,34918,Subscriber,4

In [28]:
newyork.count()

trip_duration       100000
start_date          100000
end_date            100000
start_station_id    100000
end_station_id      100000
bike_id             100000
member_type         100000
location_id         100000
dtype: int64

In [29]:
newyork = newyork[newyork["start_station_id"].isin(all_stns_df["station_id"])]
newyork = newyork[newyork["end_station_id"].isin(all_stns_df["station_id"])]
newyork

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,320,2019-01-01 00:01:47.4010,2019-01-01 00:07:07.5810,3160.0,3283.0,15839,Subscriber,4
2,591,2019-01-01 00:06:03.9970,2019-01-01 00:15:55.4380,3171.0,3154.0,27451,Subscriber,4
3,2719,2019-01-01 00:07:03.5450,2019-01-01 00:52:22.6500,504.0,3709.0,21579,Subscriber,4
4,303,2019-01-01 00:07:35.9450,2019-01-01 00:12:39.5020,229.0,503.0,35379,Subscriber,4
5,535,2019-01-01 00:08:33.1790,2019-01-01 00:17:28.3540,3630.0,3529.0,30315,Subscriber,4
...,...,...,...,...,...,...,...,...
99994,774,2019-01-03 21:42:58.5580,2019-01-03 21:55:52.7160,276.0,223.0,33988,Subscriber,4
99995,61,2019-01-03 21:43:05.5590,2019-01-03 21:44:06.8270,3137.0,3137.0,20902,Subscriber,4
99996,523,2019-01-03 21:43:19.0950,2019-01-03 21:52:02.7520,476.0,507.0,18518,Subscriber,4
99997,1179,2019-01-03 21:43:13.7950,2019-01-03 22:02:53.6280,3158.0,3383.0,16710,Customer,4
99998,292,2019-01-03 21:43:18.7030,2019-01-03 21:48:10.7200,462.0,453.0,26943,Subscriber,4

In [30]:
stns_newyork = session.query(Stations.station_id).filter(Stations.location_id==4).all()
stns_newyork = pd.DataFrame(stns_newyork)
stns_newyork = stns_newyork.rename(columns={"station_id": "start_station_id"})
stns_newyork

      start_station_id
0                 3477
1                   72
2                   79
3                   82
4                   83
...                ...
1209              4248
1210              4249
1211              4250
1212              4252
1213              4253

[1214 rows x 1 columns]

In [31]:
ny_df = pd.merge(newyork, stns_newyork, how='inner', on='start_station_id')

In [32]:
stns_newyork = stns_newyork.rename(columns={"start_station_id": "end_station_id"})
stns_newyork

      end_station_id
0               3477
1                 72
2                 79
3                 82
4                 83
...              ...
1209            4248
1210            4249
1211            4250
1212            4252
1213            4253

[1214 rows x 1 columns]

In [33]:
newyork_df = pd.merge(ny_df, stns_newyork, how='inner', on='end_station_id')

In [34]:
newyork_df

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,320,2019-01-01 00:01:47.4010,2019-01-01 00:07:07.5810,3160.0,3283.0,15839,Subscriber,4
1,353,2019-01-03 16:21:31.0120,2019-01-03 16:27:24.3650,3160.0,3283.0,32547,Subscriber,4
2,268,2019-01-02 18:24:40.9620,2019-01-02 18:29:09.1030,3171.0,3283.0,34343,Subscriber,4
3,247,2019-01-03 18:26:47.8170,2019-01-03 18:30:54.8740,3171.0,3283.0,14586,Subscriber,4
4,581,2019-01-02 15:11:26.3160,2019-01-02 15:21:07.5600,3159.0,3283.0,30809,Subscriber,4
...,...,...,...,...,...,...,...,...
81226,322,2019-01-03 18:39:55.5790,2019-01-03 18:45:18.1320,3126.0,3716.0,19302,Subscriber,4
81227,322,2019-01-03 18:43:28.4490,2019-01-03 18:48:51.3050,3344.0,3330.0,17651,Subscriber,4
81228,1853,2019-01-03 14:50:13.5400,2019-01-03 15:21:06.5930,3478.0,3330.0,34734,Subscriber,4
81229,2231,2019-01-02 10:05:48.4820,2019-01-02 10:43:00.1070,143.0,3639.0,32287,Subscriber,4
81230,2289,2019-01-03 10:15:28.3810,2019-01-03 10:53:37.6350,143.0,3639.0,34146,Subscriber,4

In [35]:
newyork_df.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')